# Shape Importer Is Service Available Method

Source: https://www.revitapidocs.com/2026/74c90acb-a638-f840-afbe-d3cf5f78bf23.htm

---

| Shape Importer Is Service Available Method |
| --- |

Checks whether the data conversion service and Material Library are available.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static bool IsServiceAvailable()
```

```
Public Shared Function IsServiceAvailable As Boolean
```

```
public:
static bool IsServiceAvailable()
```

```
static member IsServiceAvailable : unit -> bool
```

#### Return Value

Boolean
True if the data conversion service and Material Library are available, false otherwise. Remarks ShapeImporter relies on optional data conversion functionality. This function checks whether it is available. See Also

#### Reference

ShapeImporter Class Autodesk.Revit.DB Namespace